nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/glcd/processor/glcd_p32mz1064dah176.h
PLIB_INLINE_API void PLIB_GLCD_FormattingClockDivideEnable(GLCD_MODULE_ID index)
{
     GLCD_FormattingClockDivideEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_FormattingClockDivideDisable(GLCD_MODULE_ID index)
{
     GLCD_FormattingClockDivideDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_FormattingClockDivideIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_FormattingClockDivideIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsYUVOutput(GLCD_MODULE_ID index)
{
     return GLCD_ExistsYUVOutput_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_YUVOutputEnable(GLCD_MODULE_ID index)
{
     GLCD_YUVOutputEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_YUVOutputDisable(GLCD_MODULE_ID index)
{
     GLCD_YUVOutputDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_YUVOutputIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_YUVOutputIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsForceOutputBlank(GLCD_MODULE_ID index)
{
     return GLCD_ExistsForceOutputBlank_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_ForceOutputBlankEnable(GLCD_MODULE_ID index)
{
     GLCD_ForceOutputBlankEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_ForceOutputBlankDisable(GLCD_MODULE_ID index)
{
     GLCD_ForceOutputBlankDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ForceOutputBlankIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_ForceOutputBlankIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsPaletteGammaRamp(GLCD_MODULE_ID index)
{
     return GLCD_ExistsPaletteGammaRamp_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_PaletteGammaRampEnable(GLCD_MODULE_ID index)
{
     GLCD_PaletteGammaRampEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_PaletteGammaRampDisable(GLCD_MODULE_ID index)
{
     GLCD_PaletteGammaRampDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_PaletteGammaRampIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_PaletteGammaRampIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsSignalPolarity(GLCD_MODULE_ID index)
{
     return GLCD_ExistsSignalPolarity_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_SignalPolaritySet(GLCD_MODULE_ID index, GLCD_SIGNAL_POLARITY polarity)
{
     GLCD_SignalPolaritySet_Default(index, polarity);
}

PLIB_INLINE_API GLCD_SIGNAL_POLARITY PLIB_GLCD_SignalPolarityGet(GLCD_MODULE_ID index)
{
     return GLCD_SignalPolarityGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsSingleCyclePerLineVsync(GLCD_MODULE_ID index)
{
     return GLCD_ExistsSingleCyclePerLineVsync_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_SingleCyclePerLineVsyncEnable(GLCD_MODULE_ID index)
{
     GLCD_SingleCyclePerLineVsyncEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_SingleCyclePerLineVsyncDisable(GLCD_MODULE_ID index)
{
     GLCD_SingleCyclePerLineVsyncDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_SingleCyclePerLineVsyncIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_SingleCyclePerLineVsyncIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsDithering(GLCD_MODULE_ID index)
{
     return GLCD_ExistsDithering_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_DitheringEnable(GLCD_MODULE_ID index)
{
     GLCD_DitheringEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_DitheringDisable(GLCD_MODULE_ID index)
{
     GLCD_DitheringDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_DitheringIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_DitheringIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsCursor(GLCD_MODULE_ID index)
{
     return GLCD_ExistsCursor_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_CursorEnable(GLCD_MODULE_ID index)
{
     GLCD_CursorEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_CursorDisable(GLCD_MODULE_ID index)
{
     GLCD_CursorDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_CursorIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_CursorIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsEnable(GLCD_MODULE_ID index)
{
     return GLCD_ExistsEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_Enable(GLCD_MODULE_ID index)
{
     GLCD_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_Disable(GLCD_MODULE_ID index)
{
     GLCD_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_IsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_IsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsClockDivider(GLCD_MODULE_ID index)
{
     return GLCD_ExistsClockDivider_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_ClockDividerSet(GLCD_MODULE_ID index, uint32_t clockDivider)
{
     GLCD_ClockDividerSet_Default(index, clockDivider);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_ClockDividerGet(GLCD_MODULE_ID index)
{
     return GLCD_ClockDividerGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLinesPrefetch(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLinesPrefetch_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LinesPrefetchSet(GLCD_MODULE_ID index, uint32_t linesPrefetch)
{
     GLCD_LinesPrefetchSet_Default(index, linesPrefetch);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LinesPrefetchGet(GLCD_MODULE_ID index)
{
     return GLCD_LinesPrefetchGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsBackgroundColor(GLCD_MODULE_ID index)
{
     return GLCD_ExistsBackgroundColor_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_BackgroundColorSet(GLCD_MODULE_ID index, uint32_t bgColor)
{
     GLCD_BackgroundColorSet_Default(index, bgColor);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_BackgroundColorGet(GLCD_MODULE_ID index)
{
     return GLCD_BackgroundColorGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsResolutionXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsResolutionXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_ResolutionXYSet(GLCD_MODULE_ID index, uint32_t resolutionX, uint32_t resolutionY)
{
     GLCD_ResolutionXYSet_Default(index, resolutionX, resolutionY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_ResolutionXGet(GLCD_MODULE_ID index)
{
     return GLCD_ResolutionXGet_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_ResolutionYGet(GLCD_MODULE_ID index)
{
     return GLCD_ResolutionYGet_Default(index);
}

